[
  {
    "position": "Software Developer/Project Manager Intern",
    "company": "Grasshopper Air Mobility",
    "company_link": "https://www.grasshopperairmobility.com/",
    "period": "May 2025 - July 2025",
    "location": "Barcelona, Spain",
    "contributions": [
      "Researched and documented technical stack options (frontend, backend, database, hosting) and developed initial architecture for drone logistics tracking and order management system used by warehouse workers.",
      "Implemented containerization of application through open source tools like Podman using a virtual machine to avoid unnecessary expenses.",
      "Collaborated with CEO and 5-member team through 2 daily stand-up meetings, translating technical speak from the team to understandable terminology for the CEO.",
      "Hosting of full-stack project on Render for cost efficiency with documentation on how to deploy, suspend, redeploy, and delete if needed."
    ],
    "evaluation": ""
  },
  {
    "position": "Undergraduate Physics Research Assistant",
    "company": "Borough of Manhattan Community College",
    "company_link": "https://www.bmcc.cuny.edu/",
    "period": "Mar 2024 - May 2024",
    "location": "New York, NY",
    "contributions": [
      "Operated Z3 Tensile Machine using GripSoft ZPM software, optimizing data recording processes.",
      "Created a custom manual simplifying machine operation for current and future assistants.",
      "Recorded and documented experimental results to be exported to Excel, enhancing data accuracy and research efficiency."
    ],
    "evaluation": ""
  },
  {
    "position": "Product Management Intern",
    "company": "Unadat",
    "company_link": "https://unadat.com/",
    "period": "Jul 2023 - Aug 2023",
    "location": "Remote, NY",
    "contributions": [
      "Developed customer-centric project plans, conducting market research to improve product outcomes.",
      "Utilized Asana’s Sprint Planning features to define and track Sprint Goals, successfully delivering 12 potentially shippable products over 1 month.",
      "Lead Sprint Planning and Sprint Reviews for 5 cross-functional sub-teams, utilizing Asana’s timeline and board views to visualize sprint goals and track progress against the Definition of Done (DoD)."
    ],
    "evaluation": "/evals/unadat_evaluation.pdf"
  }
  
]
